posts/with-cryptos-hamlet-rightfully-asks-to-be-or-not-to-be/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>With cryptos, Hamlet rightfully asks, "To be, or not to be" | nutsandpeace</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://nutsandpeace.github.io/posts/with-cryptos-hamlet-rightfully-asks-to-be-or-not-to-be/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Vishnu Menon">
<link rel="prev" href="../regulating-the-new-kid-on-the-block/" title="Regulating the new kid on the 'Block'" type="text/html">
<meta property="og:site_name" content="nutsandpeace">
<meta property="og:title" content='With cryptos, Hamlet rightfully asks, "To be, or not to be"'>
<meta property="og:url" content="https://nutsandpeace.github.io/posts/with-cryptos-hamlet-rightfully-asks-to-be-or-not-to-be/">
<meta property="og:description" content="With cryptos, Hamlet rightfully  asks : To be, or not  be; that is the
question :



I write this only out of my  own understanding of the market as I have
been following  it from over  a year now. I ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-02-12T23:09:00+05:30">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://nutsandpeace.github.io/">

                <span id="blog-title">nutsandpeace</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">With cryptos, Hamlet rightfully asks, "To be, or not to be"</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Vishnu Menon
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-02-12T23:09:00+05:30" itemprop="datePublished" title="2018-02-12 23:09">2018-02-12 23:09</time></a></p>
                <p class="commentline">
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/with-cryptos-hamlet-rightfully-asks-to-be-or-not-to-be.html">Comments</a>


            
        </p>
<p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
With cryptos, Hamlet rightfully  asks : To be, or not  be; that is the
question :
</p>

<p>
I write this only out of my  own understanding of the market as I have
been following  it from over  a year now. I  began my research  in the
area  for  my master’s  dissertation  that  was  due, I  took  extreme
interest in  this because it  coincided with financial  technology and
economics at  large.  
(<i>For  people curious about  what happened  to my
dissertation please read on after the end of the article</i>)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">To Be:</h2>
<div class="outline-text-2" id="text-1">
<p>
The best aspects of crypto come from  the fact that it is based out of
the cryptographic system of Blockchain technology.  They are;
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Decentralised/  Distributed   Ledger</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A  ledger  is   nothing  but  a bookkeeping tool  in accounting,  
where all transactions  are recorded 
and stored, Ledgers used to be paper  records back in the day but when
computers   came  along   with   spreadsheets,  ledgers   are  now   a
database.  This  database,  distributed across  various  participants/
users across a network on the  internet is a distributed ledger. Users
across the world  save, synchronise and share the  information on this
ledger which make every user a witness to the transactions.These users
form what is called a ‘Node’.  These nodes don’t communicate with each
other  through  a central  system  rather,  each  of these  nodes  are
independent, decentralised  and has  a copy  of the  blockchain. These
nodes then form a ‘Block’ and each block has a cryptographic hash from
the previous block and this forms what we call a Blockchain.
</p>

<p>
Note: For  a Layman, This  database is managed by  all the users  in a
peer to peer network.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Eliminates Middlemen</h3>
<div class="outline-text-3" id="text-1-2">
<p>
As seen  from the previous  point, there  is no
central authority needed to validate transactions, the folks who stand
to lose  the most  from this  disruption would be  the likes  of VISA,
Mastercard  and other  payment gateways  as they  would become  nearly
obsolete  with the  intervention of  blockchain and  the decentralised
ledger system.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Geographic advantage</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This, I must say, is where its application would
really be of value. While I  was studying abroad, the biggest pain was
having money transferred from home to my bank account, it would easily
take  at   least  24  hours  if   not  more  to  get   it  transferred
internationally. Considering there were no bank holidays. Cryptos make
it possible to move money anywhere  across the world within 20 minutes
or so,  as long you have  an internet connection and  a digital wallet
of course.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Less transaction cost</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Eliminating middlemen automatically means there
are  no  hidden   costs  or  extra  transaction   costs  for  services
provided. This area is where banks and payment gateways make a killing
in terms of their profits.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">You own it</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Your crypto wallet is  owned and operated by  no one else
apart  from you  and  thus, you’re  responsible  for all  transactions
performed. This  is both an advantage  and a disadvantage as  we shall
see later.
</p>

<p>
The markets never close: Gordon  Gekko famously said That ‘MONEY NEVER
SLEEPS’. The crypto market is like  the stock markets on cocaine. When
you  trade in  the markets  all stock  markets having  an opening  and
closing time. With cryptos you can trade for as long as you lose.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Not to be</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Volatility</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You don’t have to be  the Oracle of Omaha to have figured
out  the crazy  price swings  on  a day  to  day basis  in the  crypto
trade. These swings  are unsustainable in the long  run, investors who
are very bullish  and who have the hang of  intraday trading will find
it the best playground but if you are a value investor and haven’t got
the time to look at your screen  day in and day out, then I’d suggest,
you  find  alternative  source  of investments.The  story  of  anxious
bitcoin investors  is not a myth  guys! such price swings  make anyone
even just following these markets anxious let alone having invested in
it.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Demand and  Supply Seriously?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The  main determinant of any  market is
demand and supply, even for stock markets in that regard. When we talk
about a  stock market we  are talking about multiple  companies across
multiple sectors  all over  a country. That  is very  well diversified
into  the entire  economy.  When  we talk  about  crypto  what does  a
currency truly  offer when most investors  are buying it only  to make
money  out of  its volatility.  Also, the  argument that  bitcoins are
valuable because  their limited in  number is ridiculous.  That’s like
saying I buy a  car from ford because they make only  X number of cars
per year, while I can clearly  buy from any other car manufacturer. So
where is the  lack of demand of  a product when you  have thousands of
cryptocurrencies to choose from.
</p>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Intrinsic value</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Intrinsic value means  actual value or a  real value,
this term has been used even by philosophers suggesting its importance
in morality and  ethical decision making. In finance  however, this is
done by discounting  its future cash flows to its  present value. With
tangible things  like gold we  always have high intrinsic  value, with
intangibles this  gets tricky. When  you own  an equity what  gives it
value is that you  own part of an institution, and  the way that works
in the stock markets is that you get annual dividends and interests on
your holdings.  With cryptos  there is no  interest and  dividends the
price of a crypto is determined solely, by what another guy is willing
to pay for it.  These currencies at the end of the  day are bought and
sold  with different  fiat  currencies  and so  by  itself  it has  no
value. Sure, miners work hard and solve cryptographic problems to mine
these coins but that can not really be valued monetarily.
</p>

<p>
Regulation: Read my previous article.
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Speed and Scalability</h3>
<div class="outline-text-3" id="text-2-4">
<p>
In an interview J.P Morgan’s  infamous (in the
 crypto world) CEO Jamie Dimon said that there is a delay in executing
 trades with blockchain,  it takes anywhere between 12  and 20 minutes
 to execute a  trade here while present systems  execute equity trades
 within a fraction  of a second. Will we see  the entire population of
 the world using  one single cryptocurrency? Very  Highly unlikely. So
 the sheer  scale of people and  operations that it needs  to cater is
 too large for it to sustain.
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Gone  forever</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The  ‘would  have’  been  millionaires.  The  biggest
disadvantage in this  system is that once you lose  your wallet, let’s
say you forgot your password or any issue like that. Once you lose it,
Puff, its gone and there is nothing you can do about it.  Remember the
advantage no  5. You own  it, Now if you  transfer funds to  the wrong
account  or   you  transfer  more   than  what  you  had   to,  you’re
screwed.  There  is no  way  to  reverse  the transaction  other  than
requesting the owner of the account and if that owner refuses there is
nothing you  can do to  claim your money back.  But with banks  we can
reverse payments etc.
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6">The whales</h3>
<div class="outline-text-3" id="text-2-6">
<p>
There emerged reports about how 40% of bitcoins were owned
by a handful of people. Also to  be taken into account is that Satoshi
Nakamoto owns about  1 million bitcoins these whales  can become major
market disruptors if they start to sell even small proportion of their
holdings.
</p>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7">Lets talk Security</h3>
<div class="outline-text-3" id="text-2-7">
<p>
The blockchain in itself is a highly secure system
and  its hard  to  manipulate. With  the  trading in  cryptocurrencies
however, the  same can not  be said.  Many exchanges have  been hacked
across the world with millions  of bitcoins and other currencies being
stolen. Millions of  dollars have been wiped out  from these exchanges
and  only a  very  few  of the  exchanges  have  paid their  customers
back. These  hacks are very hard  to investigate giving the  nature of
anonymity of the currency. Your Digital  wallet can still be hacked is
your personal  computer is hacked. 
</p>
</div>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8">Too good to be true</h3>
<div class="outline-text-3" id="text-2-8">
<p>
I guess  a story where the common men outsmart a
system is  fantastic. Bitcoin promised just  that- anonymity. Bitcoins
was primarily used  in Silkroad before it shot to  fame last year. The
anonymity  though is  a blessing  to  many, most  investors prefer  to
remain known and  want to disclose their  investments and transactions
to   authorities.  These   investors   are  staying   away  from   the
trade. Bitcoin  investors have no one  to seek advice from  as Satoshi
Nakamoto is anonymous.  Ethereum led by Vitalik Buterin  is a blessing
to  the   industry  as  he   and  his  company  have   become  visible
personalities for people to talk, interact and learn about the endless
possibly this technology can offer.  To believe that the crypto market
will take power  away from governments and will let  people decide the
fate  of an  economy is  genuinely  a story  that  is too  good to  be
true. People elected to be in power are there for a reason and central
banks exist to  keep a close eye  on how a country’s  economy holds up
and don’t  entertain any kind of  uncertainty that puts the  system at
risk.
</p>

<p>
In conclusion,  Be the master  of your fate,  and the captain  of your
soul. Do what you want and whatever makes you happy because none of us
know what we are talking about.
</p>



<p>
<b>The dissertation story</b>  After months of research  whilst I explained
the whole thing to my Supervisor I understood that this technology was
clearly not for everyone. After  pitching my dissertation proposal for
about 1 hour:
</p>

<p>
Supervisor:  “This Block  thing that  you  talk about,  are there  any
research papers by notable authors on this?”
</p>

<p>
(*Me in my mind:  Are you F!#$ing Kidding me! you  called it the Block
thing! After 1 hour of me saying Blockchain Technology and my research
proposal with that heading right in front of your face!*)
</p>

<p>
Me: “There are few sir, not many  though, it is a field where there is
a lot of research  as we speak there are a lot  of articles by experts
on the field and a paper from the World Economic Forum.”
</p>

<p>
Supervisor: “ I don’t think that would be credible enough please check
for more resources or I’d suggest you change your topic”
</p>

<p>
And so ladies and gentlemen I had  to change my topic 2 more times and
wrote my dissertation on  Corporate governance which was uninteresting
when compared with Blockchain technology.
</p>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../regulating-the-new-kid-on-the-block/" rel="prev" title="Regulating the new kid on the 'Block'">Previous post</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>Comments</h2>
        
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="nikolademo",
            disqus_url="https://nutsandpeace.github.io/posts/with-cryptos-hamlet-rightfully-asks-to-be-or-not-to-be/",
        disqus_title="With cryptos, Hamlet rightfully asks, \"To be, or not to be\"",
        disqus_identifier="cache/posts/with-cryptos-hamlet-rightfully-asks-to-be-or-not-to-be.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="nikolademo";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:nutsandpeace@gmail.com">Vishnu Menon</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
